# Введение в data science: работа с CSV-файлами

## Модуль csv стандартной библиотеки Python

In [2]:
import csv
with open('accounts.csv', mode = 'w') as accounts:
    writer = csv.writer(accounts)
    writer.writerows([[100,'Jones',24.98],[200, 'Doe', 345.67],[300, 'White', 0.00],[400, 'Stone', -42.16],[500, 'Rich', 224.62]])

In [3]:
with open('accounts.csv', mode = 'r') as accounts:
    readrer = csv.reader(accounts)
    print (f"{'Account':<10}{'Name':<10}{'Balance':>10}")
    for i in readrer:
        account,name,balance = i
        print (f"{account:<10}{name:<10}{balance:>10}")

Account   Name         Balance
100       Jones          24.98
200       Doe           345.67
300       White            0.0
400       Stone         -42.16
500       Rich          224.62

## Чтение CSV-файлов в коллекции DataFrame библиотеки pandas

In [5]:
import pandas as pd

In [7]:
df = pd.read_csv('accounts.csv', names = ['account','name','balance'])

In [8]:
df

   account   name  balance
0      100  Jones    24.98
1      200    Doe   345.67
2      300  White     0.00
3      400  Stone   -42.16
4      500   Rich   224.62

In [10]:
titanic = pd.read_csv('https://vincentarelbundock.github.io/' +
'Rdatasets/csv/carData/TitanicSurvival.csv')

In [11]:
titanic.head()

                        Unnamed: 0 survived     sex      age passengerClass
0    Allen, Miss. Elisabeth Walton      yes  female  29.0000            1st
1   Allison, Master. Hudson Trevor      yes    male   0.9167            1st
2     Allison, Miss. Helen Loraine       no  female   2.0000            1st
3  Allison, Mr. Hudson Joshua Crei       no    male  30.0000            1st
4  Allison, Mrs. Hudson J C (Bessi       no  female  25.0000            1st

In [12]:
titanic.columns = ['name','survived','sex','age','class']

In [14]:
titanic.tail()

                           name survived     sex   age class
1304       Zabour, Miss. Hileni       no  female  14.5   3rd
1305      Zabour, Miss. Thamine       no  female   NaN   3rd
1306  Zakarian, Mr. Mapriededer       no    male  26.5   3rd
1307        Zakarian, Mr. Ortin       no    male  27.0   3rd
1308         Zimmerman, Mr. Leo       no    male  29.0   3rd

In [17]:
pd.set_option('precision',2)
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [21]:
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [22]:
%matplotlib

Using matplotlib backend: Qt5Agg

In [23]:
histogram = titanic.hist()

In [24]:
print("Hello woorlds")

Hello woorlds